CO3 - BPMNs - CODE/DPG/254 - PURCHASE/XML/Request_Alta_DPG.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v1="http://tigo.com/josm/gateway/services/order/SimpleOrderRequest/V1">
   <soapenv:Header/>
   <soapenv:Body>
      <v1:purchaseProduct>
         <!--Optional:-->
         <v1:simpleOrderRequest>
            <channelId>1</channelId>
            <subscriberId>77777703</subscriberId>
            <productId>9002368</productId>
            <quantity>1</quantity>
            <!--Optional:-->
            <externalTransacionId>c94d5387-cdb1-41a7-b4bc-68882d5964b5</externalTransacionId>
            <comment>Activacion_DPG</comment>
            <additionalParameters>
               <parameter>
                  <key>eventType</key>
                  <value>ACTIVACION_CLIENTE_DPG</value>
               </parameter>
               <parameter>
                  <key>ACCOUNT</key>
                  <value>1231241</value>
               </parameter>
               <parameter>
                  <key>AMOUNT</key>
                  <value>50</value>
               </parameter>
               <parameter>
                  <key>TYPE</key>
                  <value>DPA</value>
               </parameter>
                <parameter>
                  <key>PAYMENT_METHOD</key><!--Enviado desde Pagos en activacion externa-->
                  <value>1045</value><!--Enviar 0 cuando sea alta desde siebel-->
               </parameter>
            </additionalParameters>
            <!--Optional:-->
         </v1:simpleOrderRequest>
      </v1:purchaseProduct>
   </soapenv:Body>
</soapenv:Envelope>